ccm.callback['ccm.textcorpus.json']({
	"text1" : {
		"key" : "text1",
		"content" : [
			"A widow had two daughters; one was pretty and industrious, the other was ugly and lazy. And as the ugly one was her own daughter, she loved her much the best, and the pretty one was made to do all the work, and be the drudge of the house. Every day the poor girl had to sit by a well on the high road and spin until her fingers bled. Now it happened once that as the spindle was bloody, she dipped it into the well to wash it; but it slipped out of her hand and fell in. Then she began to cry, and ran to her step-mother, and told her of her misfortune; and her stepmother scolded her without mercy, and said in her rage: \"As you have let the spindle fall in, you must go and fetch it out again!\" Then the girl went back again to the well, not knowing what to do, and in the despair of her heart she jumped down into the well the same way the spindle had gone. After that she knew nothing; and when she came to herself she was in a beautiful meadow, and the sun was shining on the flowers that grew round her. And she walked on through the meadow until she came to a baker\"s oven that was full of bread; and the bread called out to her: \"Oh, take me out, take me out, or I shall burn; I am baked enough already!\" Then she drew near, and with the baker\"s peel she took out all the loaves one after the other. And she went farther on till she came to a tree weighed down with apples, and it called out to her: \"Oh, shake me, shake me, we apples are all of us ripe!\" Then she shook the tree until the apples fell like rain, and she shook until there were no more to fall; and when she had gathered them together in a heap, she went on farther. At last she came to a little house, and an old woman was peeping out of it, but she had such great teeth that the girl was terrified and about to run away, only the old woman called her back. \"What are you afraid of, my dear child? Come and live with me, and if you do the house-work well and orderly, things shall go well with you. You must take great pains to make my bed well, and shake it up thoroughly, so that the feathers fly about, and then in the world it snows, for I am Mother Hulda.\" As the old woman spoke so kindly, the girl took courage, consented, and went to her work. She did everything to the old woman\"s satisfaction, and shook the bed with such a will that the feathers flew about like snow-flakes: and so she led a good life, had never a cross word, but boiled and roast meat every day. When she had lived a long time with Mother Hulda, she began to feel sad, not knowing herself what ailed her; at last she began to think she must be home-sick; and although she was a thousand times better off than at home where she was, yet she had a great longing to go home. At last she said to her mistress: \"I am homesick, and although I am very well off here, I cannot stay any longer; I must go back to my own home.\" Mother Hulda answered: \"It pleases me well that you should wish to go home, and, as you have served me faithfully, I will undertake to send you there!\" She took her by the hand and led her to a large door standing open, and as she was passing through it there fell upon her a heavy shower of gold, and the gold hung all about her, so that she was covered with it. \"All this is yours, because you have been so industrious,\" said Mother Hulda; and, besides that, she returned to her her spindle, the very same that she had dropped in the well. And then the door was shut again, and the girl found herself back again in the world, not far from her mother\"s house; and as she passed through the yard the cock stood on the top of the well and cried: \"Cock-a-doodle doo! Our golden girl has come home too!\"",
			"Then she went in to her mother, and as she had returned covered with gold she was well received.",
			"So the girl related all her history, and what had happened to her, and when the mother heard how she came to have such great riches she began to wish that her ugly and idle daughter might have the same good fortune. So she sent her to sit by the well and spin; and in order to make her spindle bloody she put her hand into the thorn hedge. Then she threw the spindle into the well, and jumped in herself. She found herself, like her sister, in the beautiful meadow, and followed the same path, and when she came to the baker\"s oven, the bread cried out: \"Oh, take me out, take me out, or I shall burn; I am quite done already!\" But the lazy-bones answered: \"I have no desire to black my hands,\" and went on farther. Soon she came to the apple-tree, who called out: \"Oh, shake me, shake me, we apples are all of us ripe!\" But she answered: \"That is all very fine; suppose one of you should fall on my head,\" and went on farther. When she came to Mother Hulda\"s house she did not feel afraid, as she knew beforehand of her great teeth, and entered into her service at once. The first day she put her hand well to the work, and was industrious, and did everything Mother Hulda bade her, because of the gold she expected; but the second day she began to be idle, and the third day still more so, so that she would not get up in the morning. Neither did she make Mother Hulda\"s bed as it ought to have been made, and did not shake it for the feathers to fly about. So that Mother Hulda soon grew tired of her, and gave her warning, at which the lazy thing was well pleased, and thought that now the shower of gold was coming; so Mother Hulda led her to the door, and as she stood in the doorway, instead of the shower of gold a great kettle full of pitch was emptied over her. \"That is the reward for your service,\" said Mother Hulda, and shut the door. So the lazy girl came home all covered with pitch, and the cock on the top of the well seeing her, cried: \"Cock-a-doodle doo! Our dirty girl has come home too!\"",
			"And the pitch remained sticking to her fast, and never, as long as she lived, could it be got off."
		]
	},
	
	"text2" : {
		"key" : "text2",
		"content" : [
			"Once upon a time there was a sweet little girl. Everyone who saw her liked her, but most of all her grandmother, who did not know what to give the child next. Once she gave her a little cap made of red velvet. Because it suited her so well, and she wanted to wear it all the time, she came to be known as Little Red Riding Hood. One day her mother said to her: Come Little Red Riding Hood. Here is a piece of cake and a bottle of wine. Take them to your grandmother. She is sick and weak, and they will do her well. Mind your manners and give her my greetings. Behave yourself on the way, and do not leave the path, or you might fall down and break the glass, and then there will be nothing for your sick grandmother.",
			"Little Red Riding Hood promised to obey her mother. The grandmother lived out in the woods, a half hour from the village. When Little Red Riding Hood entered the woods a wolf came up to her. She did not know what a wicked animal he was, and was not afraid of him. Good day to you, Little Red Riding Hood. - Thank you, wolf. - Where are you going so early, Little Red Riding Hood? - To grandmothers. - And what are you carrying under your apron? - Grandmother is sick and weak, and I am taking her some cake and wine. We baked yesterday, and they should give her strength. - Little Red Riding Hood, just where does your grandmother live? - Her house is a good quarter hour from here in the woods, under the three large oak trees. Theres a hedge of hazel bushes there. You must know the place, said Little Red Riding Hood. The wolf thought to himself: Now there is a tasty bite for me. Just how are you going to catch her? Then he said: Listen, Little Red Riding Hood, havent you seen the beautiful flowers that are blossoming in the woods? Why dont you go and take a look? And I dont believe you can hear how beautifully the birds are singing. You are walking along as though you were on your way to school in the village. It is very beautiful in the woods.",
			"Little Red Riding Hood opened her eyes and saw the sunlight breaking through the trees and how the ground was covered with beautiful flowers. She thought: If a take a bouquet to grandmother, she will be very pleased. Anyway, it is still early, and Ill be home on time. And she ran off into the woods looking for flowers. Each time she picked one she thought that she could see an even more beautiful one a little way off, and she ran after it, going further and further into the woods. But the wolf ran straight to the grandmothers house and knocked on the door. Whos there? - Little Red Riding Hood. Im bringing you some cake and wine. Open the door for me. - Just press the latch, called out the grandmother. Im too weak to get up. The wolf pressed the latch, and the door opened. He stepped inside, went straight to the grandmothers bed, and ate her up. Then he took her clothes, put them on, and put her cap on his head. He got into her bed and pulled the curtains shut.",
			"Little Red Riding Hood had run after flowers, and did not continue on her way to grandmothers until she had gathered all that she could carry. When she arrived, she found, to her surprise, that the door was open. She walked into the parlor, and everything looked so strange that she thought: Oh, my God, why am I so afraid? I usually like it at grandmothers. Then she went to the bed and pulled back the curtains. Grandmother was lying there with her cap pulled down over her face and looking very strange. Oh, grandmother, what big ears you have! - All the better to hear you with. - Oh, grandmother, what big eyes you have! - All the better to see you with. - Oh, grandmother, what big hands you have! - All the better to grab you with! - Oh, grandmother, what a horribly big mouth you have! - All the better to eat you with! And with that he jumped out of bed, jumped on top of poor Little Red Riding Hood, and ate her up.",
			"As soon as the wolf had finished this tasty bite, he climbed back into bed, fell asleep, and began to snore very loudly. A huntsman was just passing by. He thought it strange that the old woman was snoring so loudly, so he decided to take a look. He stepped inside, and in the bed there lay the wolf that he had been hunting for such a long time. He has eaten the grandmother, but perhaps she still can be saved. I wont shoot him, thought the huntsman. So he took a pair of scissors and cut open his belly. He had cut only a few strokes when he saw the red cap shining through. He cut a little more, and the girl jumped out and cried: Oh, I was so frightened! It was so dark inside the wolfs body! And then the grandmother came out alive as well. Then Little Red Riding Hood fetched some large heavy stones. They filled the wolfs body with them, and when he woke up and tried to run away, the stones were so heavy that he fell down dead.",
			"The three of them were happy. The huntsman took the wolfs pelt. The grandmother ate the cake and drank the wine that Little Red Riding Hood had brought. And Little Red Riding Hood thought to herself: As long as I live, I will never leave the path and run off into the woods by myself if mother tells me not to.",
			"They also tell how Little Red Riding Hood was taking some baked things to her grandmother another time, when another wolf spoke to her and wanted her to leave the path. But Little Red Riding Hood took care and went straight to grandmothers. She told her that she had seen the wolf, and that he had wished her a good day, but had stared at her in a wicked manner. If we hadnt been on a public road, he would have eaten me up, she said. Come, said the grandmother. Lets lock the door, so he cant get in. Soon afterward the wolf knocked on the door and called out: Open up, grandmother. Its Little Red Riding Hood, and Im bringing you some baked things. They remained silent, and did not open the door. The wicked one walked around the house several times, and finally jumped onto the roof. He wanted to wait until Little Red Riding Hood went home that evening, then follow her and eat her up in the darkness. But the grandmother saw what he was up to. There was a large stone trough in front of the house. Fetch a bucket, Little Red Riding Hood, she said. Yesterday I cooked some sausage. Carry the water that I boiled them with to the trough. Little Red Riding Hood carried water until the large, large trough was clear full. The smell of sausage arose into the wolfs nose. He sniffed and looked down, stretching his neck so long that he could no longer hold himself, and he began to slide. He slid off the roof, fell into the trough, and drowned. And Little Red Riding Hood returned home happily and safely."
		]
	},
	
	"text3" : {
		"key" : "text3",
		"content" : [
			"Police declared a gathering outside the city's convention centre unlawful and made 35 arrests, as stones and water bottles were thrown. Mr Trump was in the city near the Mexican border to hold a rally ahead of the 7 June California primary. He has pledged to build a border wall to keep out illegal immigrants. The skirmishes flared as the convention centre emptied following Mr Trump's rally, and supporters and opponents met in the streets, jeering and heckling each other Dozens of police officers in riot gear had been deployed to separate them. Some protesters scaled a wall of the centre to throw water bottles at police. After ordering the crowds to disperse, police then moved them away from the city's Gaslamp Quarter.",
			"San Diego's population is about one-third Latino and hundreds of thousands of people cross the border with Mexico legally each day. One San Diego protester, Martha McPhail, told the local City News Service: \"I am opposed to the hateful, bigoted, racist language of Donald Trump and his arrogance and intolerance. \"I'm for all of our people - all races, sexes, genders, military veterans - and he's divisive.\" But Trump supporter Riley Hansen defended the controversial businessman.",
			"\"My Dad always told me you need a businessman as president. I like his policies,\" he told CNS. The San Diego Police Department said that 35 arrests had been made and there was no damage to property and no injuries reported. Mr Trump tweeted to the police after the event: \"Fantastic job on handling the thugs who tried to disrupt our very peaceful and well attended rally.\" Mr Trump told an earlier rally in Fresno that California had \"no drought\", despite the state seeing its driest ever four-year period. After speaking to farmers who complained of a lack of water for crops, he said: \"They don't understand, nobody understands it. There is no drought. They turn the water out into the ocean.\" The reference appeared to be about water discharged from the Sacramento River into the San Francisco Bay, partly to protect endangered species. Mr Trump said that if he came to power he would \"start opening up the water\" and ensure farmers had enough for crops. The comments sparked some mockery on social media - a number of tweets carried links to Charlton Heston in his role as Moses parting the Red Sea in the 1956 film The Ten Commandments. ",
			"Mr Trump is running unopposed in California after his Republican rivals pulled out and he reached the number of delegates needed to secure the nomination. It has yet to be formalised. Earlier on Friday, Mr Trump backed out of an offer to debate with Democratic candidate Bernie Sanders. \"As much as I want to debate Bernie Sanders - and it would be an easy payday - I will wait to debate the first place finisher in the Democratic Party, probably Crooked Hillary Clinton, or whoever it may be,\" the Trump campaign said in a statement. Mr Sanders told reporters on the campaign trail that he hoped Mr Trump would change his mind. \"Well Mr Trump, what are you afraid of?\" he said, calling the Republican nominee a \"bully\". Mr Trump said the Democratic nominating process was \"rigged\" - and that Mrs Clinton and Democratic National Committee Chairwoman Deborah Wasserman Schultz would not allow Mr Sanders to win the nomination. The latest opinion polls suggest Mrs Clinton leads Mr Trump by about four percentage points."
		]
	},
	
	"text4" : {
		"key" : "text4",
		"content" : [
			"Russian President Vladimir Putin on Friday warned Romania and Poland they could find themselves in the sights of Russian rockets because they are hosting elements of a U.S. missile shield that Moscow considers a threat to its security. Putin issued his starkest warning yet over the missile shield, saying that Moscow had stated repeatedly that it would have to take retaliatory steps but that Washington and its allies had ignored the warnings. Earlier this month the U.S. military -- which says the shield is needed to protect from Iran, not threaten Russia -- switched on the Romanian part of the shield. Work is going ahead on another part of the shield, in Poland. \"If yesterday in those areas of Romania people simply did not know what it means to be in the cross-hairs, then today we will be forced to carry out certain measures to ensure our security,\" Putin told a joint news conference in Athens with Greek Prime Minister Alexis Tsipras. \"It will be the same case with Poland,\" he said. Putin did not specify what actions Russia would take, but he insisted that it was not making the first step, only responding to moves by Washington. \"We won't take any action until we see rockets in areas that neighbor us.\" He said the argument that the project was needed to defend against Iran made no sense because an international deal had been reached to curb Tehran's nuclear program. The missiles that will form the shield can easily reach Russian cities, he said. \"How can that not create a threat for us?\" Putin asked. He voiced frustration that Russia's complaints about the missile shield had not been heeded. \"We've been repeating like a mantra that we will be forced to respond... Nobody wants to hear us. Nobody wants to conduct negotiations with us.\"",
			"Putin sounded a defiant note over Crimea, the Ukrainian region which Russia annexed in 2014. Moscow said it was acting on the will of the Crimean people, who voted to join Russia, but Western governments say it was an illegal land grab. \"As far as Crimea is concerned, we consider this question is closed forever,\" Putin said. \"Russia will not conduct any discussions with anyone on this subject.\" The Russian leader also touched on relations with Turkey, which have been toxic since the Turkish military shot down a Russian fighter jet near the Syrian-Turkish border last November. Ankara said the plane strayed into Turkish airspace, an allegation Moscow denies. Putin said he was ready to consider restoring relations with Ankara, but that would require a first step from Turkey, and so far there was no sign of that. Putin was asked about the South Stream project, a planned gas pipeline from Russia that would have gone under the Black Sea to Bulgaria and onwards to southern Europe. Russia shelved the project after Bulgaria backed out. He blamed the U.S. government and the European Commission, saying they had pressured Sofia to withdraw. But he said Russia was going ahead with an extension of its Nordstream pipeline in the Baltic, and he hoped no one would try to hinder that project."
		]
	},
	
	"text5" : {
		"key" : "text5",
		"content" : [
			"A wonderful serenity has taken possession of my entire soul, like these sweet mornings of spring which I enjoy with my whole heart. I am alone, and feel the charm of existence in this spot, which was created for the bliss of souls like mine. I am so happy, my dear friend, so absorbed in the exquisite sense of mere tranquil existence, that I neglect my talents. I should be incapable of drawing a single stroke at the present moment; and yet I feel that I never was a greater artist than now.",
			"When, while the lovely valley teems with vapour around me, and the meridian sun strikes the upper surface of the impenetrable foliage of my trees, and but a few stray gleams steal into the inner sanctuary, I throw myself down among the tall grass by the trickling stream; and, as I lie close to the earth, a thousand unknown plants are noticed by me: when I hear the buzz of the little world among the stalks, and grow familiar with the countless indescribable forms of the insects and flies, then I feel the presence of the Almighty, who formed us in his own image, and the breath of that universal love which bears and sustains us, as it floats around us in an eternity of bliss; and then, my friend, when darkness overspreads my eyes, and heaven and earth seem to dwell in my soul and absorb its power, like the form of a beloved mistress, then I often think with longing, Oh, would I could describe these conceptions, could impress upon paper all that is living so full and warm within me, that it might be the mirror of my soul, as my soul is the mirror of the infinite God!",
			"O my friend -- but it is too much for my strength -- I sink under the weight of the splendour of these visions! A wonderful serenity has taken possession of my entire soul, like these sweet mornings of spring which I enjoy with my whole heart. I am alone, and feel the charm of existence in this spot, which was created for the bliss of souls like mine. I am so happy, my dear friend, so absorbed in the exquisite sense of mere tranquil existence, that I neglect my talents. I should be incapable of drawing a single stroke at the present moment; and yet I feel that I never was a greater artist than now.",
			"When, while the lovely valley teems with vapour around me, and the meridian sun strikes the upper surface of the impenetrable foliage of my trees, and but a few stray gleams steal into the inner sanctuary, I throw myself down among the tall grass by the trickling stream; and, as I lie close to the earth, a thousand unknown plants are noticed by me: when I hear the buzz of the little world among the stalks, and grow familiar with the countless indescribable forms of the insects and flies, then I feel the presence of the Almighty, who formed us in his own image, and the breath of that universal love which bears and sustains us, as it floats around us in an eternity of bliss; and then, my friend, when darkness overspreads my eyes, and heaven and earth seem to dwell in my soul and absorb its power, like the form of a beloved mistress, then I often think with longing, Oh, would I could describe these conceptions, could impress upon paper all that is living so full and warm within me, that it might be the mirror of my soul, as my soul is the mirror of the infinite God!",
			"O my friend -- but it is too much for my strength -- I sink under the weight of the splendour of these visions! A wonderful serenity has taken possession of my entire soul, like these sweet mornings of spring which I enjoy with my whole heart. I am alone, and feel the charm of existence in this spot, which was created for the bliss of souls like mine. I am so happy, my dear friend, so absorbed in the exquisite sense of mere tranquil existence, that I neglect my talents.",
			"I should be incapable of drawing a single stroke at the present moment; and yet I feel that I never was a greater artist than now.",
			"When, while the lovely valley teems with vapour around me, and the meridian sun strikes the upper surface of the impenetrable foliage of my trees, and but a few stray gleams steal into the inner sanctuary, I throw myself down among the tall grass by the trickling stream; and, as I lie close to the earth, a thousand unknown plants are noticed by me: when I hear the buzz of the little world among the stalks, and grow familiar with the countless indescribable forms of the insects and flies, then I feel the presence of the Almighty, who formed us in his own image, and the breath of that universal love which bears and sustains us, as it floats around us in an eternity of bliss; and then, my friend, when darkness overspreads my eyes, and heaven and earth seem to dwell in my soul and absorb its power, like the form of a beloved mistress, then I often think with longing, Oh, would I could describe these conceptions, could impress upon paper all that is living so full and warm within me, that it might be the mirror of my soul, as my soul is the mirror of the infinite God! O my friend -- but it is too much for my strength -- I sink under the weight of the splendour of these visions! A wonderful serenity has taken possession of my entire soul, like these sweet mornings of spring which I enjoy with my whole heart."
		]
	},
	
	"text6" : {
		"key" : "text6",
		"content" : [
			"The Enigma machines were a series of electro-mechanical rotor cipher machines developed and used in the early- to mid-twentieth century to protect commercial, diplomatic and military communication. Enigma was invented by the German engineer Arthur Scherbius at the end of World War I.[1] Early models were used commercially from the early 1920s, and adopted by military and government services of several countries, most notably Nazi Germany before and during World War II.[2] Several different Enigma models were produced, but the German military models are the most commonly recognised. However, Japanese and Italian models have been used. German military messages enciphered on the Enigma machine were first broken by the Polish Cipher Bureau, beginning in December 1932. This success was a result of efforts by three Polish cryptologists, Marian Rejewski, Jerzy Różycki and Henryk Zygalski, working for Polish military intelligence. Rejewski reverse-engineered the device, using theoretical mathematics and material supplied by French military intelligence. Subsequently the three mathematicians designed mechanical devices for breaking Enigma ciphers, including the cryptologic bomb. From 1938 onwards, additional complexity was repeatedly added to the Enigma machines, making decryption more difficult and requiring further equipment and personnel—more than the Poles could readily produce. On 26 and 27 July 1939,[3] in Pyry near Warsaw, the Poles initiated French and British military intelligence representatives into their Enigma-decryption techniques and equipment, including Zygalski sheets and the cryptologic bomb, and promised each delegation a Polish-reconstructed Enigma. The demonstration represented a vital basis for the later British continuation and effort.[4] During the war, British cryptologists decrypted a vast number of messages enciphered on Enigma. The intelligence gleaned from this source, codenamed \"Ultra\" by the British, was a substantial aid to the Allied war effort.[5] Though Enigma had some cryptographic weaknesses, in practice it was German procedural flaws, operator mistakes, failure to systematically introduce changes in encipherment procedures, and Allied capture of key tables and hardware that, during the war, enabled Allied cryptologists to succeed and \"turned the tide\" in the Allies' favor.[6][7]",
			"A German Enigma operator would be given a plaintext message to encrypt. For each letter typed in, a lamp indicated a different letter according to a pseudo-random substitution, based upon the wiring of the machine. The letter indicated by the lamp would be recorded as the enciphered substitution. The action of pressing a key also moved the rotor so that the next key press used a different electrical pathway, and thus a different substitution would occur. For each key press there was rotation of at least the right hand rotor, giving a different substitution alphabet. This continued for each letter in the message until the message was completed and a series of substitutions, each different from the others, had occurred to create a cyphertext from the plaintext. The cyphertext would then be transmitted as normal to an operator of another Enigma machine. This operator would key in the cyphertext and—as long as all the settings of the deciphering machine were identical to those of the enciphering machine—for every key press the reverse substitution would occur and the plaintext message would emerge."
		]
	},
	
	"text7" : {
		"key" : "text7",
		"content" : [
			"Owls are birds from the order Strigiformes, which includes about two hundred species of mostly solitary and nocturnal birds of prey typified by an upright stance, a large, broad head, binocular vision, binaural hearing, sharp talons, and feathers adapted for silent flight. Exceptions include the diurnal northern hawk-owl and the gregarious burrowing owl. Owls hunt mostly small mammals, insects, and other birds although a few species specialize in hunting fish. They are found in all regions of the Earth except Antarctica and some remote islands. Owls are divided into two families: the true owls or typical owls, Strigidae; and the barn-owls, Tytonidae.",
			"Owls possess large forward-facing eyes and ear-holes; a hawk-like beak; a flat face; and usually a conspicuous circle of feathers, a facial disc, around each eye. The feathers making up this disc can be adjusted in order to sharply focus sounds from varying distances onto the owls' asymmetrically placed ear cavities. Most birds of prey have eyes on the sides of their heads, but the stereoscopic nature of the owl's forward-facing eyes permits the greater sense of depth perception necessary for low-light hunting. Although owls have binocular vision, their large eyes are fixed in their sockets—as are those of other birds—so they must turn their entire head to change views. As owls are farsighted, they are unable to see clearly anything within a few centimeters of their eyes. Caught prey can be felt by owls with the use of filoplumes—like feathers on the beak and feet that act as \"feelers\". Their far vision, particularly in low light, is exceptionally good. Owls can rotate their heads and necks as much as 270 degrees. Owls have fourteen neck vertebrae compared to seven in humans which makes their necks more flexible. They also have adaptations to their circulatory systems, permitting rotation without cutting off blood to the brain: the foramina in their vertebrae through which the vertebral arteries pass are about ten times the diameter of the artery, instead of about the same size as the artery as in humans; the vertebral arteries enter the cervical vertebrae higher than in other birds, giving the vessels some slack; and the carotid arteries unite in a very large anastomosis or junction, the largest of any bird's, preventing loss of blood supply from being cut off while they rotate their necks. Other anastomoses between the carotid and vertebral arteries support this effect.[1][2] The smallest owl—weighing as little as 31 grams (1 oz) and measuring some 13.5 centimetres (5 in)—is the elf owl (Micrathene whitneyi).[3] Around the same diminutive length, although slightly heavier, are the lesser known long-whiskered owlet (Xenoglaux loweryi) and Tamaulipas pygmy owl (Glaucidium sanchezi).[3] The largest owl by length is the great grey owl (Strix nebulosa), which measures around 70 cm (28 in) on average and can attain a length of 84 cm (33 in).[3] However, the heaviest (and largest winged) owls are two similarly-sized eagle owls; the Eurasian eagle-owl (Bubo bubo) and Blakiston's fish owl (B. blakistoni). These two species, which are on average about 2.53 cm (1.00 in) shorter in length than the great grey, can both attain a wingspan of 2 m (6.6 ft) and a weight of 4.5 kg (10 lb) in the largest females.[3][4][5][6][7] Different species of owls produce different sounds; this distribution of calls aids owls in finding mates or announcing their presence to potential competitors, and also aids ornithologists and birders in locating these birds and distinguishing species. As noted above, the facial disc helps owls to funnel the sound of prey to their ears. In many species, these discs are placed asymmetrically, for better directional location. Owl plumage is generally cryptic, although several species have facial and head markings, including face masks, ear tufts and brightly coloured irises. These markings are generally more common in species inhabiting open habitats, and are thought to be used in signaling with other owls in low light conditions.[8]",
			"Most owls are nocturnal, actively hunting their prey in darkness. Several types of owl, however, are crepuscular—active during the twilight hours of dawn and dusk; one example is the pygmy owl (Glaucidium). A few owls are active during the day also; examples are the burrowing owl (Speotyto cunicularia) and the short-eared owl (Asio flammeus). Much of the owls' hunting strategy depends on stealth and surprise. Owls have at least two adaptations that aid them in achieving stealth. First, the dull coloration of their feathers can render them almost invisible under certain conditions. Secondly, serrated edges on the leading edge of owls' remiges muffle an owl's wing beats, allowing an owl's flight to be practically silent. Some fish-eating owls, for which silence has no evolutionary advantage, lack this adaptation. An owl's sharp beak and powerful talons allow it to kill its prey before swallowing it whole (if it is not too big). Scientists studying the diets of owls are helped by their habit of regurgitating the indigestible parts of their prey (such as bones, scales, and fur) in the form of pellets. These \"owl pellets\" are plentiful and easy to interpret, and are often sold by companies to schools for dissection by students as a lesson in biology and ecology.[13]",
			"Most owls share an innate ability to fly almost silently and also more slowly in comparison to other birds of prey. Most owls live a mainly nocturnal lifestyle and being able to fly without making any noise gives them a strong advantage over their prey that are listening for the slightest sound in the night. A silent, slow flight is not as necessary for diurnal and crepuscular owls given that prey can usually see an owl approaching. While the morphological and biological mechanisms of this silent flight are more or less unknown, the structure of the feather has been heavily studied and accredited to a large portion of why they have this ability. Owls’ feathers are generally larger than the average birds’ feathers, have fewer radiates, longer pennulum, and achieve smooth edges with different rachis structures.[14] Serrated edges along the owl’s remiges bring the flapping of the wing down to a nearly silent mechanism. Research has shown that the serrations are more likely reducing aerodynamic disturbances, rather than simply reducing noise.[14] The surface of the flight feathers is covered with a velvety structure that absorbs the sound of the wing moving. These unique structures reduce noise frequencies above 2 kHz,[15] making the sound level emitted drop below the typical hearing spectrum of the owl’s usual prey[15][16] and also within the owl’s own best hearing range.[citation needed] This optimizes the owl’s ability to silently fly in order to capture prey without the prey hearing the owl first as it flies in. It also allows the owl to monitor the sound output from its flight pattern. The feather adaption that allows silent flight means that barn owl feathers are not waterproof. To retain the softness and silent flight, the barn owl cannot use the preen oil or powder dust that other species use for waterproofing. In wet weather, they cannot hunt and this may be disastrous during the breeding season. Barn owls are frequently found drowned in cattle drinking troughs, since they land to drink and bathe, but are unable to climb out. Owls can struggle to keep warm, because of their lack of waterproofing, so large numbers of downy feathers help them to retain body heat.[17]",
			"Eyesight is a particular characteristic of the owl that aids in nocturnal prey capture. Owls are part of a small group of birds that live nocturnally, but do not use echolocation to guide them in flight in low-light situations. Owls are known for their disproportionally large eyes in comparison to their skull. An apparent consequence of the evolution of an absolutely large eye in a relatively small skull is that the eye of the owl has become tubular in shape. This shape is found in other so-called nocturnal eyes, such as the eyes of strepsirrhine primates and bathypelagic fishes.[18] Since the eyes are fixed into these sclerotic tubes, they are unable to move the eyes in any direction.[19] Instead of moving their eyes, owls swivel their head to visualize their surroundings. Owls' heads are capable of swiveling through an angle of approximately 270°, easily enabling them to see behind them without relocating the torso.[19] This ability keeps bodily movement at a minimum and thus reduces the amount of sound the owl makes as it waits for its prey. Owls are regarded as having the most frontally placed eyes among all avian groups, which gives them some of the largest binocular fields of vision. However, owls are farsighted and cannot focus on objects within a few centimeters of their eyes.[18][20] While it is commonly believed that owls have great nocturnal vision due to their large (and thus very light-gathering) eyes and pupils and/or extremely sensitive rod receptors, the true cause for their ability to see in the night is due to neural mechanisms which mediate the extraction of spatial information gathered from the retinal image throughout the nocturnal luminance range. These mechanisms are only able to function due to the large-sized retinal image.[21] Thus, the primary nocturnal function in the vision of the owl is due to its large posterior nodal distance; retinal image brightness is only maximized to the owl within secondary neural functions.[21] These attributes of the owl cause its nocturnal eyesight to be far superior to that of its average prey.[21]",
			"Owls exhibit specialized hearing functions and ear shapes that also aid in hunting. They are noted for asymmetrical ear placements on the skull in some genera. Owls can have either internal or external ears, both of which are asymmetrical. Asymmetry has not been reported to extend to the middle or internal ear of the owl. Asymmetrical ear placement on the skull allows the owl to pinpoint the location of its prey. This is especially true for strictly nocturnal species such as the barn owls 'Tyto' or Tengmalm's owl.[19] With ears set at different places on its skull, an owl is able to determine the direction from which the sound is coming by the minute difference in time that it takes for the sound waves to penetrate the left and right ears.[citation needed] The owl turns its head until the sound reaches both ears at the same time, at which point it is directly facing the source of the sound. This time difference between ears is a matter of about 0.00003 seconds, or 30 millionths of a second. Like the eyes, which utilize feather movements to focus light,[citation needed][dubious – discuss] the ears are surrounded by feathers to maximize hearing capabilities. Behind the ear openings there are modified, dense feathers, densely packed to form a facial ruff, which creates an anteriorly-facing concave wall that cups the sound into the ear structure.[22] This facial ruff is poorly defined in some species and prominent, nearly encircling the face, in other species. The facial disk also acts to direct sound into the ears, and a downward-facing, sharply triangular beak minimizes sound reflection away from the face. The shape of the facial disk is adjustable at will to focus sounds more effectively.[19] It is a common misapprehension that the prominences above a great horned owl's head are its ears. This is not the case; they are merely feather tufts. The ears are on the sides of the head in the usual location (in two different locations as described above)."
		]
	}, 
	
	"text8" : {
		"key" : "text8",
		"content" : [
			"Sequoia National Park is a national park in the southern Sierra Nevada east of Visalia, California, in the United States. It was established on September 25, 1890. The park spans 404,064 acres (631.35 sq mi; 163,518.90 ha; 1,635.19 km2).[1] Encompassing a vertical relief of nearly 13,000 feet (4,000 m), the park contains among its natural resources the highest point in the contiguous 48 United States, Mount Whitney, at 14,494 feet (4,418 m) above sea level. The park is south of and contiguous with Kings Canyon National Park; the two are administered by the National Park Service together as the Sequoia and Kings Canyon National Parks. They were designated the UNESCO Sequoia-Kings Canyon Biosphere Reserve in 1976.[3] The park is famous for its giant sequoia trees, including the General Sherman tree, one of the largest trees on Earth. The General Sherman tree grows in the Giant Forest, which contains five out of the ten largest trees in the world. The Giant Forest is connected by the Generals Highway to Kings Canyon National Park's General Grant Grove, home to the General Grant tree among other giant sequoias. The park's giant sequoia forests are part of 202,430 acres (81,921 ha) of old-growth forests shared by Sequoia and Kings Canyon National Parks.[4] Indeed, the parks preserve a landscape that still resembles the southern Sierra Nevada before Euro-American settlement.[5]",
			"Many park visitors enter Sequoia National Park through its southern entrance near the town of Three Rivers at Ash Mountain at 1,700 ft (520 m) elevation. The lower elevations around Ash Mountain contain the only National Park Service-protected California Foothills ecosystem, consisting of blue oak woodlands, foothills chaparral, grasslands, yucca plants, and steep, mild river valleys. The region is also home to abundant : bobcats, foxes, ground squirrels, rattlesnakes, and mule deer are commonly seen in this area, and more rarely, reclusive mountain lions and the Pacific fisher are seen as well. The last California grizzly was killed in this park in 1922 (at Horse Corral Meadow).[6] The California Black Oak is a key transition species between the chaparral and higher elevation conifer forest.[7] At higher elevations in the front country, between 5,500 and 9,000 feet (1,700 and 2,700 m) in elevation, the landscape becomes montane forest-dominated coniferous belt. Found here are Ponderosa, Jeffrey, sugar, and lodgepole pine trees, as well as abundant white and red fir. Found here too are the mighty giant sequoia trees, the most massive living single-stem trees on earth. Between the trees, spring and summer snowmelts sometimes fan out to form lush, though delicate, meadows. In this region, visitors often see mule deer, Douglas squirrels, and American black bears, which sometimes break into unattended cars to eat food left by careless visitors. There are plans to reintroduce the bighorn sheep to this park.[8]",
			"The vast majority of the park is roadless wilderness; no road crosses the Sierra Nevada within the park's boundaries. 84 percent of Sequoia and Kings Canyon National Parks is designated wilderness[9] and is accessible only by foot or by horseback. Sequoia's backcountry offers a vast expanse of high-alpine wonders. Covering the highest-elevation region of the High Sierra, the backcountry includes Mount Whitney on the eastern border of the park, accessible from the Giant Forest via the High Sierra Trail. On a traveler's path along this 35-mile (56 km) backcountry trail, one passes through about 10 miles (16 km) of montane forest before reaching the backcountry resort of Bearpaw Meadow, just short of the Great Western Divide. Continuing along the High Sierra Trail over the Great Western Divide via Kaweah Gap, one passes from the Kaweah River Drainage, with its characteristic V-shaped river valleys, and into the Kern River drainage, where an ancient fault line has aided glaciers in the last ice age to create a U-shaped canyon that is almost perfectly straight for nearly 20 miles (32 km). On the floor of this canyon, at least two days hike from the nearest road, is the Kern Canyon hot spring, a popular resting point for weary backpackers. From the floor of Kern Canyon, the trail ascends again over 8,000 ft (2,400 m) to the summit of Mount Whitney. At Mount Whitney, the High Sierra Trail meets with the John Muir Trail and the Pacific Crest Trail, which continue northward along the Sierra crest and into the backcountry of Kings Canyon National Park.",
			"The area which now comprises Sequoia National Park was first home to Monachee (or Western Mono) Native Americans, who resided mainly in the Kaweah River drainage in the Foothills region of the park, though evidence of seasonal habitation exists even as high as the Giant Forest. In the summertime, Native Americans would travel over the high mountain passes to trade with tribes to the East. To this day, pictographs can be found at several sites within the park, notably at Hospital Rock and Potwisha, as well as bedrock mortars used to process acorns, a staple food for the Monachee people. Tharp's Log, a cabin formed out of a hollowed-out Giant Sequoia log By the time the first European settlers arrived in the area, smallpox had already spread to the region, decimating Native American populations. The first European settler to homestead in the area was Hale Tharp, who famously built a home out of a hollowed-out fallen giant sequoia log in the Giant Forest next to Log Meadow. Tharp allowed his cattle to graze the meadow, but at the same time had a respect for the grandeur of the forest and led early battles against logging in the area. From time to time, Tharp received visits from John Muir, who would stay at Tharp's log cabin. Tharp's Log can still be visited today in its original location in the Giant Forest. However, Tharp's attempts to conserve the giant sequoias were at first met with only limited success. In the 1880s, white settlers seeking to create a utopian society founded the Kaweah Colony, which sought economic success in trading Sequoia timber. However, Sequoia trees, unlike their coast redwood relatives, were later discovered to splinter easily and therefore were ill-suited to timber harvesting, though thousands of trees were felled before logging operations finally ceased. The National Park Service incorporated the Giant Forest into Sequoia National Park in 1890, the year of its founding, promptly ceasing all logging operations in the Giant Forest. The park has expanded several times over the decades to its present size; one of the most recent expansions occurred in 1978, when grassroots efforts, spearheaded by the Sierra Club, fought off attempts by the Walt Disney Corporation to purchase a high-alpine former mining site south of the park for use as a ski resort. This site was annexed to the park to become Mineral King, the highest-elevation developed site within the park and a popular destination for backpackers."
		]
	}
	
});
